app/controllers/home_controller.rb

SELECT * FROM `feeds` WHERE (account_number = '32194468451') LIMIT 1
SELECT * FROM `profiles` WHERE (`profiles`.user_id = 18) LIMIT 1
SELECT * FROM `offers` WHERE (`offers`.feed_id = 13 AND (response like('counter') or response like ('last'))) ORDER BY offers.id DESC LIMIT 1
---
  def index
    if logged_in?
        if current_user.biz?
          if current_user.is_verified == true
            if current_user.profile.nil?
              render :template => "/users/profile"
            elsif current_user.feeds.size <= 0
              @feeds = current_user.feeds
              render :template => "/users/upload_option"
            else
              @notifications = [["profile", current_user.profile.created_at],["feeds", current_user.feeds.last.created_at]]
              @notifications.sort!{|n1, n2| n2[1] <=> n1[1]}
              render :template => "/home/notifications"
            end
          end
        elsif current_user.is_verified == false
          render :template => "/users/agree"
        else
          @feed = current_user.feed_info
          if !@feed.phone1.blank? and !@feed.email.blank?#session[:skip_verify]
            @offer = @feed.offers.last(:conditions => ["response IS NULL"])

UPDATE `offers` SET `updated_at` = '2012-08-09 06:53:29', `response` = 'last' WHERE `id` = 73
---
                @offer = @rejected_offer
                @counter_offer  = @rejected_offer
                @counter_offer.response = "last"
                @counter_offer.save