app/controllers/users_controller.rb

  def login
    if request.post?
        if !params[:user][:account_number].strip.blank?
            @feed = Feed.first(:conditions => ["account_number = ?", params[:user][:account_number]])
            @user = User.find_by_account_number(params[:user][:account_number])
        end
        if @feed
            if @user.nil?
                @user = User.new(:account_number => params[:user][:account_number])
                @user.save
---
SELECT * FROM `users` WHERE (`users`.`account_number` = '32194468451') LIMIT 1
SELECT * FROM `feeds` WHERE (account_number = '32194468451') LIMIT 1
INSERT INTO `users` (`created_at`, `remember_token_expires_at`, `updated_at`, `remember_token`, `is_verified`, `account_number`, `password`, `email`) VALUES('2012-08-09 06:55:52', NULL, '2012-08-09 06:55:52', NULL, 0, '98428252639', NULL, NULL)

  def agree
    if logged_in?
      if request.post?
        current_user.update_attribute(:is_verified, params[:agree])
---
UPDATE `users` SET `updated_at` = '2012-08-09 06:55:54', `is_verified` = 1 WHERE `id` = 34

  def verify
    if logged_in?
      @feed = current_user.feed_info
      if request.post?
        if params[:commit]
          if @feed.update_attributes(params[:feed])
---
UPDATE `feeds` SET `updated_at` = '2012-08-09 06:54:59', `phone1` = '898020344', `email` = 'briejshshah86@gmail.com' WHERE `id` = 10

  def negotiate
    @feed = current_user.feed_info
    @offer = @feed.offers.last(:conditions => "response IS NULL")
    @last_offer = false
    if request.post?
      submit = params[:submit_button]
      if submit
        if submit.strip.downcase == "accept"
          @counter_offer = @feed.offers.last(:conditions => ["response like (?) or response like (?)", "counter", "last"])
          for offer in @feed.offers.all(:conditions => "response IS NULL")
---
SELECT * FROM `offers` WHERE (`offers`.feed_id = 13 AND (response like ('counter') or response like ('last'))) ORDER BY offers.id DESC LIMIT 1
SELECT * FROM `feeds` WHERE (account_number = '26799919245') LIMIT 1
SELECT * FROM `offers` WHERE (response like ('counter')) AND (`offers`.feed_id = 29)

          @offer = Offer.new
          @offer.feed = @feed
          @offer.amount = amount
          @offer.save
---
INSERT INTO `offers` (`response`, `created_at`, `updated_at`, `amount`, `feed_id`) VALUES(NULL, '2012-08-09 06:56:10', '2012-08-09 06:56:10', 1000.0, 29)
UPDATE `offers` SET `updated_at` = '2012-08-09 06:53:37', `response` = 'rejected' WHERE `id` = 73

  def schedule
    @accepted_offer = Offer.find_by_id(params[:id])
---
SELECT * FROM `offers` WHERE (`offers`.`id` = '27') LIMIT 1

  def payment
    @offer = Offer.find_by_id(params[:id])
---
SELECT * FROM `offers` WHERE (`offers`.`id` = '27') LIMIT 1